In [18]:
import pandas as pd 
import os
from Functions import evaluate

In [2]:
os.listdir("./data/in/the-movies-dataset")

['credits.csv',
 'keywords.csv',
 'links.csv',
 'links_small.csv',
 'movies_metadata.csv',
 'ratings.csv',
 'ratings_small.csv']

In [3]:
dates = pd.read_csv("data/in/the-movies-dataset/movies_metadata.csv", usecols=['id','release_date'])

In [4]:
dates.head()

      id release_date
0    862   1995-10-30
1   8844   1995-12-15
2  15602   1995-12-22
3  31357   1995-12-22
4  11862   1995-02-10

In [5]:
# pd.to_datetime(dates['release_date']) get errors

In [6]:
def get_error_indx(data_col):
    error_indx = []
    for i in range(data_col.shape[0]):
        try:
            pd.to_datetime(data_col[i])
        except:
            error_indx.append(i)
    return error_indx

In [7]:
error_indx = get_error_indx(dates['release_date'])

In [8]:
dates.iloc[error_indx]

               id release_date
19730  1997-08-20            1
29503  2012-09-29           12
35587  2014-01-01           22

it seems that the to columns replaced

In [9]:
dates.loc[error_indx,['id','release_date']] = dates.loc[error_indx,['release_date','id']].values

In [10]:
dates.iloc[error_indx]

       id release_date
19730   1   1997-08-20
29503  12   2012-09-29
35587  22   2014-01-01

Done

In [11]:
dates.isna().any()

id              False
release_date     True
dtype: bool

In [12]:
dates.dropna(inplace=True)

In [13]:
dates.duplicated().sum()

30

In [14]:
dates.drop_duplicates(inplace=True)

In [15]:
dates["release_date"] = pd.to_datetime(dates['release_date'])

In [16]:
dates['year'] = dates['release_date'].dt.year.astype(int)
dates['quarter'] = dates['release_date'].dt.to_period('Q').dt.strftime('Q%q')
dates['month'] = dates['release_date'].dt.month_name()
dates['day'] = dates['release_date'].dt.day_name()

In [17]:
dates

           id release_date  year quarter     month       day
0         862   1995-10-30  1995      Q4   October    Monday
1        8844   1995-12-15  1995      Q4  December    Friday
2       15602   1995-12-22  1995      Q4  December    Friday
3       31357   1995-12-22  1995      Q4  December    Friday
4       11862   1995-02-10  1995      Q1  February    Friday
...       ...          ...   ...     ...       ...       ...
45460   30840   1991-05-13  1991      Q2       May    Monday
45462  111109   2011-11-17  2011      Q4  November  Thursday
45463   67758   2003-08-01  2003      Q3    August    Friday
45464  227506   1917-10-21  1917      Q4   October    Sunday
45465  461257   2017-06-09  2017      Q2      June    Friday

[45349 rows x 6 columns]

In [20]:
evaluate.create_dir("data/out")
dates.to_csv("data/out/Dim-Dates.csv", index=False)

File Exist